# 📌 파일 쓰기
    # 파일을 읽거나 쓰기 위해서는 파일을 open 해야 하고, 작업 완료 후 반드시 close 해야 함
    # (with 키워드를 사용하여 생략 가능))

    # ✨ 파일 객체 = open(파일명, 파일모드, 인코딩)
    # 1️⃣ r : 읽기 모드 - 파일을 읽기 위해 사용
    # 2️⃣ w : 쓰기 모드 - 파일에 내용을 쓸 때 사용 (기존의 파일 지워짐)
    # 3️⃣ a : 추가 모드 - 파일의 마지막에 새로운 내용을 추가 시킬 때 사용
    # 파일을 열 때 경로는 절대 경로 상대 경로로 지정 할 수 있음. (path를 지정하지 않으면 현재 터미널 위치에 생성)
    # encoding="utf8"은 한글 깨짐 방지를 위한 인코딩

score_file = open("score.txt", "w", encoding="utf8") 
print("수학 : 0", file=score_file)
print("영어 : 50", file=score_file)
score_file.write("과학 : 80" + "\n")
score_file.write("코딩 : 100" + "\n")
score_file.close()

# 📌 파일 읽기
    # 1️⃣ read()      : 파일 내의 모든 내용을 읽어 하나의 문자열로 반환
    # 2️⃣ readline()  : 해당 파일의 내용을 한 라인씩 읽어 들여 문자열로 반환,
    #                  파일의 끝(EOF)에 도달하여 가져올 라인이 없으면 None을 반환
    # 3️⃣ readlines() : 해당 파일의 모든 라인을 순서대로 읽어 들여 각각의 라인을 하나의 요소로 저장하는 하나의 리스트 반환


